function fillAnalyticsSidebar(){
	var regionList = ["Вся Россия","Алтайский край","Амурская область","Архангельская область","Астраханская область","Белгородская область","Брянская область","Владимирская область","Волгоградская область","Вологодская область","Воронежская область","Еврейская автономная область","Забайкальский край","Ивановская область","Иркутская область","Кабардино-Балкарская республика","Калининградская область","Калужская область","Камчатский край","Карачаево-Черкесская республика","Кемеровская область","Кировская область","Костромская область","Краснодарский край","Красноярский край","Курганская область","Курская область","Ленинградская область","Липецкая область","Магаданская область","Москва","Московская область","Мурманская область","Ненецкий автономный округ","Нижегородская область","Новгородская область","Новосибирская область","Омская область","Оренбургская область","Орловская область","Пензенская область","Пермский край","Приморский край","Псковская область","Республика Адыгея","Республика Алтай","Республика Башкортостан","Республика Бурятия","Республика Дагестан","Республика Ингушетия","Республика Калмыкия","Республика Карелия","Республика Коми","Республика Марий Эл","Республика Мордовия","Республика Саха (Якутия)","Республика Северная Осетия-Алания","Республика Татарстан (Татарстан)","Республика Тыва","Республика Хакасия","Ростовская область","Рязанская область","Самарская область","Санкт-Петербург","Саратовская область","Сахалинская область","Свердловская область","Смоленская область","Ставропольский край","Тамбовская область","Тверская область","Томская область","Тульская область","Тюменская область","Удмуртская республика","Ульяновская область","Хабаровский край","Ханты-Мансийский автономный округ - Югра","Челябинская область","Чеченская республика","Чувашская Республика - Чувашия","Чукотский автономный округ","Ямало-Ненецкий автономный округ","Ярославская область"];
	var box = document.getElementById("filter-select-region");
	for (var i in regionList) {
	    var opt = document.createElement("option");
	    opt.value = regionList[i];
	    opt.innerHTML = regionList[i];
	    box.appendChild(opt);
	};
	var profAreaList = ["Авиационная промышленность","Сельское хозяйство","IT отрасль","Машиностроение","Текстильная промышленность","..."];
	var box = document.getElementById("filter-select-prof-area");
	for (var i in profAreaList) {
	    var opt = document.createElement("option");
	    opt.value = profAreaList[i];
	    opt.innerHTML = profAreaList[i];
	    box.appendChild(opt);
	};

}